---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.CableTrayType
source: html/3448bbee-446a-d14a-33be-7bc23e15db8c.htm
---
# CableTrayType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.